In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

In [6]:
df  = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    664     11   John  January      Q1
1  2023-01-02       B   West    550     25   Mary  January      Q1
2  2023-01-03       C  North    328     91    Bob  January      Q1
3  2023-01-04       D  South    454     54  Alice  January      Q1
4  2023-01-05       A   East    774     77   John  January      Q1
5  2023-01-06       B   West    997     93   Mary  January      Q1
6  2023-01-07       C  North    414     65    Bob  January      Q1
7  2023-01-08       D  South    632     78  Alice  January      Q1
8  2023-01-09       A   East    995     55   John  January      Q1
9  2023-01-10       B   West    419     44   Mary  January      Q1
10 2023-01-11       C  North    926     34    Bob  January      Q1
11 2023-01-12       D  South    886     88  Alice  January      Q1
12 2023-01-13       A   East    185     38   John  January      Q1
13 2023-01-14       B   West    690     90   Mary  January      Q1
14 2023-01-15       C  North    347     31    Bob  January      Q1
15 2023-01-16       D  South    587     63  Alice  January      Q1
16 2023-01-17       A   East    118     28   John  January      Q1
17 2023-01-18       B   West    332     52   Mary  January      Q1
18 2023-01-19       C  North    727     19    Bob  January      Q1
19 2023-01-20       D  South    655     65  Alice  January      Q1

In [9]:
pivot1 = pd.pivot_table(df,values="Sales",index="Region",columns="Product",aggfunc="median")
pivot1

Product      A      B      C      D
Region
East     664.0    NaN    NaN    NaN
North      NaN    NaN  414.0    NaN
South      NaN    NaN    NaN  632.0
West       NaN  550.0    NaN    NaN

In [10]:
pivot2 = pd.pivot_table(df,values=["Sales","Units"],index="Region",columns="Product",aggfunc="median")
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     664.0    NaN    NaN    NaN  38.0   NaN   NaN   NaN
North      NaN    NaN  414.0    NaN   NaN   NaN  34.0   NaN
South      NaN    NaN    NaN  632.0   NaN   NaN   NaN  65.0
West       NaN  550.0    NaN    NaN   NaN  52.0   NaN   NaN

**Cross Tabs**

In [29]:
pd.crosstab(df['Region'],df['Product']) ## Here we do the count

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

In [30]:
pd.crosstab(index=df["Region"],columns=df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0